Repository: CometVisu/CometVisu
Catalog: source/translation/*.po
Languages: de

source: Please describe what you have done until the error occured?
de: Bitte beschreiben, was Sie gemacht haben bis der Fehler aufgetreten ist.

source: An error occured
de: Ein Fehler ist aufgetreten

source: Enable on reload:
de: Aktivieren beim neu Laden:

source: Reload
de: Neu laden

source: Please do not forget to attach the downloaded Logfile to this ticket.
de: Bitte vergessen Sie nicht, die heruntergeladenen Log-Datei an dieses Ticket zu hängen.

source: Action recording
de: Benutzerinteraktionen aufzeichnen

source: Send error to sentry.io
de: Fehlerbericht an sentry.io schicken

source: Error reporting (on sentry.io)
de: Absturzberichte senden (an sentry.io)

source: Connection error
de: Verbindungsfehler

source: Error requesting %1: %2 - %3.
de: Fehler beim Laden von %1: %2 - %3.

source: Connection to backend is lost.
de: Verbindung zum Backend verloren.

source: CometVisu protocol error
de: CometVisu Protokollfehler

source: The backend did send an invalid response to the %1Login%2 request: missing protocol version.
de: Das Backend hat eine ungültige Antwort auf die %1Login%2-Anfrage geschickt: Fehlende Protokollversion.

source: Please try to fix the problem in the backend.
de: Bitte versuchen Sie das Problem im Backend zu lösen.

source: Backend-Response:
de: Antwort des Backends:

source: Backend does not respond!
de: Backend antwortet nicht!

source: File has been saved
de: Datei wurde gespeichert

source: Error saving file
de: Fehler beim Speichern der Datei

source: Template loading error
de: Fehler beim Laden des Templates

source: Template '%1' could not be loaded from '%2'.
de: Template '%1' konnte nicht geladen werden von '%2'.

source: The CometVisu seems to be delivered by a proxied webserver. Changing configuration values might not have the expected effect. Please proceed only if you know what you are doing.
de: Die CometVisu scheint über einen Proxy ausgeliefert zu werden. Änderungen an den Einstellungen könnten deshalb nicht den gewünschten Effekt habe.Bitte führen Sie daher nur Änderungen durch, wenn Sie wissen was Sie tun.

source: openHAB backend settings
de: openHAB Backend Einstellungen

source: Cancel
de: Abbruch

source: Save
de: Speichern

source: Delete all
de: Alle löschen

source: Message center
de: Nachrichtenzentrale

source: config folder does not exists
de: config Ordner existiert nicht

source: config folder is not readable
de: config Ordner kann nicht gelesen werden

source: config folder is not writeable
de: config Ordner ist nicht beschreibbar

source: backup folder is not writeable
de: backup Ordner ist nicht beschreibbar

source: media folder is not writeable
de: media Ordner ist nicht beschreibbar

source: Hidden configuration file (hidden.php) not writeable
de: Die versteckte Konfiguration (hidden.php) ist nicht beschreibbar

source: Cannot load config template
de: Template für Konfigurationsdatei kann nicht geladen werden

source: Cannot load file content
de: Dateiinhalt kann nicht geladen werden

source: Cannot open file: "%1"
de: Datei "%1" kann nicht geöffnet werden

source: This file has unsaved changes that will be lost when you close it. Do you really want to close the file?
de: Diese Datei enthält ungesicherte Änderungen, die verloren gehen, wenn Sie die Datei schließen. Möchten Sie die Datei wirklich schließen?

source: This file has not been saved on the backend yet. It will be lost when you close it. Do you really want to close the file?
de: Diese Datei wurde noch nicht gespeichert. Sie wird verloren gehen, wenn Sie sie schließen. Möchten Sie die Datei wirklich schließen?

source: Unsaved changes
de: Nicht gespeicherte Änderungen

source: A configuration with this name already exists.
de: Eine Konfigurationsdatei mit diesem Namen existiert bereits.

source: Please enter the file name.
de: Bitte geben Sie den Dateinamen ein.

source: A file with this name already exists.
de: Eine Datei mit diesem Namen exisitert bereits.

source: Please enter the folder name.
de: Bitte geben Sie den Namen des Ordners ein.

source: A folder with this name already exists.
de: Eine Ordner mit diesem Namen exisitert bereits.

source: Folder has been created
de: Verzeichnis wurde erstellt

source: New file
de: Neue Datei

source: New folder
de: Neuer Ordner

source: New config file
de: Neue Konfigurationsdatei

source: Upload file
de: Datei hochladen

source: Save as...
de: Speichern unter...

source: Delete
de: Löschen

source: Quit
de: Beenden

source: Ctrl+Z
de: Strg+Z

source: Undo
de: Rückgängig

source: Ctrl+Y
de: Strg+Y

source: Redo
de: Wiederholen

source: Ctrl+X
de: Strg+X

source: Cut
de: Ausschneiden

source: Copy
de: Kopieren

source: Ctrl+C
de: Strg+C

source: Ctrl+V
de: Strg+V

source: Paste
de: Einfügen

source: Use text editor
de: Texteditor benutzen

source: Use xml editor
de: XML-Editor benutzen

source: Enable quick preview
de: Schnellvorschau aktivieren

source: Expert mode
de: Expertenansicht

source: File
de: Datei

source: Edit
de: Bearbeiten

source: New
de: Neu

source: Preferences
de: Einstellungen

source: List mode
de: Listenansicht

source: Preview mode
de: Vorschau-Modus

source: Configurations
de: Konfigurationen

source: Demo configurations
de: Demo Konfigurationen

source: Media files
de: Mediendateien

source: Miscellaneous
de: Sonstiges

source: Hidden configuration
de: Versteckte Konfiguration

source: Download
de: Herunterladen

source: Validate
de: Prüfen

source: Clear
de: Leeren

source: Backup from %1
de: Sicherung vom %1

source: New name
de: Neuer Name

source: Rename file
de: Datei umbenennen

source: Clone file
de: Datei duplizieren

source: Rename
de: Umbenennen

source: Open
de: Öffnen

source: Restore
de: Wiederherstellen

source: Replace
de: Ersetzen

source: Compare with...
de: Vergleichen mit...

source: Open with...
de: Öffnen mit...

source: File "%1" has been created
de: Datei "%1" wurde angelegt

source: Folder "%1" has been created
de: Ordner "%1" wurde angelegt

source: File "%1" has been renamed
de: Datei "%1" wurde umbenannt

source: Folder "%1" has been renamed
de: Ordner "%1" wurde umbenannt

source: File "%1" has been moved
de: Datei "%1" wurde verschoben

source: Folder "%1" has been moved
de: Ordner "%1" wurde verschoben

source: %1 has been restored
de: %1 wurde wieder hergestellt

source: File "%1" has been restored
de: Datei "%1" wurde wieder hergestellt

source: Folder "%1" has been restored
de: Ordner "%1" wurde wieder hergestellt

source: Do you really want to clear the trash?
de: Mächten Sie den Papirtkorb wirklich leeren?

source: Do you really want to delete file "%1" from the trash?
de: Möchten Sie die Datei "%1" wirklich aus dem Papierkorb löschen?

source: Do you really want to delete folder "%1" from the trash?
de: Möchten Sie den Ordner "%1" wirklich aus dem Papierkorb löschen?

source: Do you really want to delete file "%1"?
de: Möchten Sie die Datei "%1" wirklich löschen?

source: Do you really want to delete folder "%1"?
de: Möchten Sie den Ordner "%1" wirklich löschen?

source: Confirm deletion
de: Löschen bestätigen

source: Trash has been cleared
de: Der Papierkorb wurde geleert

source: File "%1" has been removed from trash
de: Datei "%1" wurde aus dem Papierkorb gelöscht

source: Folder "%1" has been removed from trash
de: Ornder "%1" wurde aus dem Papierkorb gelöscht

source: File "%1" has been deleted
de: Datei "%1" wurde gelöscht

source: Folder "%1" has been deleted
de: Ordner "%1" wurde gelöscht

source: Validating %1
de: Prüfe %1

source: %1 has no errors!
de: %1 hat keine Fehler!

source: %1 error found in %2!
de: %1 Fehler gefunden in %2!

source: File has been created
de: Datei wurde erstellt

source: Section name duplicate: "%1".
de: Doppelter Sektionsname: "%1".

source: Option key duplicate: "%1" in section "%2".
de: Doppelter Optionsname "%1" in Sektion "%2".

source: Saving hidden config failed with error %1 (%2)
de: Das Speichern der versteckten Konfiguration ist fehlgeschlagen: %1 (%2)

source: Hidden config has been saved
de: Die Verstackte Konfiguration wurde gespeichert

source: Section is invalid and has not been saved.
de: Diese Sektion ist ungültig und wurde nicht gespeichert.

source: Add section
de: Sektion hinzufügen

source: File compare
de: Datei vergleichen

source: Variable from template %1
de: Variable aus Template %1

source: Drop the file here to replace the content.
de: Lassen Sie die Datei hier fallen um den Inhalt zu ersetzen.

source: Do you really want to replace the '%1' with the uploaded files content?
de: Möchten Sie wirklich '%1' mit der hochgeladenen Datei ersetzen?

source: Double click to open "%1"
de: Doppelklick zum Öffnen von "%1"

source: Download file
de: Datei herunterladen

source: Other file actions
de: Andere Datei-Aktionen

source: This file is not writeable
de: Diese Datei ist nicht änderbar

source: Delete option
de: Option löschen

source: Add option
de: Option hinzufügen

source: Key
de: Schlüssel

source: Value
de: Wert

source: Section
de: Sektion

source: Delete section
de: Sektion löschen

source: Diff: %1
de: Vergleich: %1

source: Trash
de: Papierkorb

source: Replacing the file failed.
de: Das Ersetzen der Datei ist fehlgeschlagen.

source: This file already exists, do you want to replace it?
de: Diese Datei existiert bereits, möchten Sie sie überschreiben?

source: File already exists
de: Diese Datei existiert bereits

source: Uploading this file is not allowed here.
de: Das Hochladen der Datei ist an dieser Stelle nicht erleubt.

source: File upload stopped with an error: %1
de: Das Hochladen der Datei wurde mit einem Fehler beendet: %1

source: File has been uploaded
de: Die Datei wurde hochgeladen

source: Config viewer
de: Konfiguration anzeigen

source: %1 is no configuration file
de: %1 ist keine Konfigurationsdatei

source: Show folder
de: Ordner anzeigen

source: Filter by name...
de: Nach Namen filtern...

source: Show icons
de: Icons anzeigen

source: Show image
de: Bild anzeigen

source: unknown: %1
de: Unbekannt: %1

source: Config-File Error!
de: Fehler in Konfigurations-Datei!

source: Invalid config file!
de: Ungültige Konfigurations-Datei!

source: Please check!
de: Bitte prüfen!

source: Config file has wrong library version!
de: Konfigurations-Datei hat die falsche 'library' Version!

source: This can cause problems with your configuration
de: Das kann Probleme in Ihrer Konfiguration verursachen

source: You can run the %1Configuration Upgrader%2.
de: Sie können den %1Konfigurations-Upgrader%2 laufen lassen.

source: Or you can start without upgrading %1with possible configuration problems%2
de: Oder Sie starten ohne Upgrade %1mit möglichen Konfigurations-Problemen%2

source: 404: Config file not found. Neither as normal config (%1) nor as demo config (%2).
de: 404: Konfigurations-Datei nicht gefunden. Weder als normale Konfiguration (%1) noch als Demo-Konfiguration (%2)

source: Unhandled error of type "%1"
de: Unbekannter Fehler vom Typ "%1"

source: Error loading plugin "%1"
de: Plugin "%1" konnte nicht geladen werden

source: File %1 could not be loaded.
de: Datei %1 konnte nicht geladen werden.

source: File loading error
de: Datei-Ladefehler

source: Validating configuration file...
de: Validiere Konfigurations-Datei...

source: The %1 configuration has no errors!
de: Die %1 Konfiguration hat keine Fehler!

source: The %1 configuration has %2 errors!
de: Die %1 Konfiguration hat %2 Fehler!

source: Show errors
de: Fehler anzeigen

source: Please enter the name of the new configuration (without "visu_config_" at the beginning and ".xml" at the end)
de: Bitte geben Sie den Namen der neuen Konfiguraton (ohne "visu_config_" am Anfang und ".xml" am Ende) ein

source: Config file has been upgraded to the current library version.
de: Die Konfigurations-Datei wurde auf die aktuelle Version aktualisiert.

source: The following changes have been made
de: Die folgendenen Änderungen wurden vorgenommen

source: You can check the changes in the editor. The left side shows the content before the upgrade and the right side shows the content after the upgrade.
de: Sie können die Änderungen im Editor überprüfen. Die linke Seite zeigt den Inhalt vor der Aktualisierung, die rechte Seite nachher.

source: Changes are highlighted. Please save the file and reload the browser to apply the changes.
de: Die Änderungen wurden hervorgehoben. Bitte speichern Sie die Datei und aktualisieren Sie die Seite im Browser, damit die Änderungen wirksam werden.

source: Upgrade successful
de: Aktualisierung erfolgreich

source: Hidden config is invalid, please correct the errors
de: Die versteckte Konfiguration ist ungültig, bitte beheben Sie die Fehler

source: Hidden config content has some warnings! It is recommended to fix the warnings before saving. Save anyways?
de: Die versteckte Konfiguration enthält eventuell Fehler! Es wird empfohlen die Warnungen zu beheben, bevor gespeichert wird. Trotzdem speichern?

source: Confirm saving with warnings
de: Speichen trotz Warnungen bestätigen

source: The XML-Editor does not support files that are not writeable!
de: Der XML-Editor unterstützt keine Dateien, die nicht gespeichert werden können!

source: The backend did send an invalid response to a %1read%2 request: Missing "i" value.
de: Das Backend hat eine ungültige Antwort für eine %1Lese%2-Anfrage gesendet: Fehlender "i" Wert.

source: Upgrader from version %1 not implemented
de: Aktualisieren von Version %1 nicht implementiert

source: Click "Apply" if you want to save the changes and reload the browser.
de: Klicken Sie "Anwenden", wenn Sie die Änderungen speichern und die aktualisierte Konfigurations-Datei laden möchten.

source: Click "Check" if you want to check the changes. You have to save the changes and reload your browser yourself in this case.
de: Klicken Sie "Prüfen", wenn Sie die Änderungen überprüfen möchten. In diesem Fall müssen Sie selbst die Datei speichern und den Browser neu laden, damit die Änderungen wirksam werden.

source: Apply
de: Anwenden

source: Check
de: Prüfen

source: No changes have been made
de: Es wurden keine Änderungen vorgenommen

source: Help
de: Hilfe

source: Add child
de: Kind-Element einfügen

source: Undo: %1
de: Rückgängig: %1

source: Expertview
de: Expertenansicht

source: Reload preview
de: Vorschau aktualisieren

source: Search...
de: Suchen...

source: <p style='font-weight:bold'>Choose element</p><p>Several possible element can be created at this position, please select one to proceed.</p>
de: <p style='font-weight:bold'>Element wählen</p><p>Verschiedene Elemente können an dieser Stelle eingefügt werden, bitte wählen sie eines aus.</p>

source: Choose element
de: Element wählen

source: Please choose the element you want to add here.
de: Bitte wählen sie das Element, welches hinzugefügt werden soll.

source: not set
de: nicht angegeben

source: This is not a valid value.
de: Dies ist kein gültiger Wert.

source: Edit %1
de: Bearbeite %1

source: Show %1
de: Zeige %1

source: Value is invalid
de: Wert ist ungültig

source: Remove %1
de: Lösche %1

source: Move %1
de: Verschiebe %1

source: Add %1
de: Erzeuge %1

source: Invalid text content: %1
de: Ungültiger Text-Inhalt: %1

source: Text content not allowed here
de: Kein Text-Inhalt erlaubt

source: Change %1
de: Ändere %1

source: complex type, please see documentation
de: Komplexer Typ, bitte in der Dokumentation nachschauen

source: Drag to move
de: Klicken & Ziehen zum Verschieben

source: This configuration has been opened in another window. When you close this file, the window will also be closed. Click here top jump the the window.
de: Diese Konfiguration wurde in einem anderen Fenster geöffnet. Wenn Sie diese Datei schließen, wird das Fenster ebenfalls geschlossen. Klicken zu hier, um zu dem Fenster zu gelangen.

source: <h3>Search for elements</h3><p>You can search for element names (tag names or content of name attribute) by typing a search value here. All elements whose tag name or name-attribute start with the search term will be found</p><p>Search will start automatically when the search term is at least 2 characters long.</p><p>The first found element will be opened and selected in the element tree. You can jump to the next found element with 'Enter' or the 'Down' key. Accordingly you can jump the the previous found element with the 'Up' key.</p>
de: <h3>Suche nach Elementen</h3><p>Sie können nach Elementen suchen (Tag-Namen oder Name-Attribut) indem Sie hier einen Suchbegriff eingeben. Es werden alle Elemente gefunden deren Tag-Name oder 'name'-Attribut mit dem Suchbegriff beginnen.</p><p>Die Suche startet automatisch, wenn der Suchbegriff mindestens 2 Zeichen lang ist.</p><p>Das erste gefunden Element wird im Baum angezeigt. Mit der 'enter' oder der 'Pfeil runter'-Taste kann man zum nächsten Suchergebnis springen. Mit der 'Pfeil rauf'-Taste entsprechend zum vorherigen Suchergebnis.</p>

source: View
de: Ansehen

source: <h3>Config Errors</h3><p>The validation of "%1" showed some errors. It is NOT recommended to edit this file in the XML-Tree editor, because it can break the file completely. Please open this file in the text editor and fix the errors there. Only proceed to edit the file in the XML-Tree editor if you know what you are doing.</p>
de: <h3>Fehler in der Konfiguration</h3><p>Die Überprüfung von "%1" hat Fehler gefunden. Es wird NICHT empfohlen, diese Datei im XML-Editor zu bearbeiten, weil die Möglichkeit besteht, dass sie dadurch unbrauchbar wird. Bitte öffnen Sie die Datei im Texteditor und beheben Sie die Fehler dort. Fahren Sie nur fort, wenn Sie wissen was Sie tun.</p>

source: <p>You can choose between the following options:<ul> <li><b>Cancel</b> - Close this editor</li> <li><b>Proceed</b> - Open the defective file in this editor</li> <li><b>Open in text editor</b> - Close this editor and open the defective file in the text editor</li></ul></p>
de: <p>Sie können zwischen folgenden Optionen wählen:<ul> <li><b>Abbrechen</b> - Diesen Editor schließen</li> <li><b>Fortfahren</b> - Ungültige Datei in diesem Editor öffnen</li> <li><b>Öffnen in Text-Editor</b> - Diesen Editor schließen und die ungültige Datei im Text-Editor öffnen</li></ul></p>

source: Proceed
de: Fortfahren

source: Open in text editor
de: Im Text-Editor öffnen

source: Loading...
de: Lade...

source: <h3>CometVisu XML-Editor - a brief introduction</h3><p>The CometVisu XMl-Editor shows the content of a CometVisu config file in a tree-like structure. You can traverse through the tree by opening/closing elements with a click on the expand icon.</p><p>The Xml-Editor will make sure that you do not create an invalid configuration file. If you experience a change that has not been accepted / or is not allowed that is most likely due to avoid an invalid configuration.</p><h4>Editing attributes</h4><p>The elements attributes can be edited by double clicking on it or selecting an element and clicking on the 'edit'-button in the toolbar above the tree of by right-clicking on the element and the 'edit'-button in the context menu</p><h4>Editing elements</h4><p>The elements in the tree support re-ordering via drag & drop. You can also cut/copy or paste them. You can add new elements by starting a drag in the round + button on the bottom of the tree, or by right clicking on an element and choosing the 'add child'-button.</p><p>You can delete elements by the delete buttons in the toolbar</p><h4>Expert view</h4><p>Some attributes are hidden in the editing dialog, because they provide access to settings that usually are not needed that often. You can access these attributes by toggling to the 'Expertview'-button in the toolbar directly above the tree.</p><h4>Config preview</h4><p>An preview of the edited config file is shown on the right part of the screen. The preview will not automatically refresh after you have changed something. You can refresh is manually by clicking the most right button in the toolbar.</p>
de: <h3>CometVisu XML-Editor - eine kurze Einführung</h3><p>Der CometVisu XML-Editor stellt eine CometVisu-Konfigurationsdatei in einer Baumstruktur dar. Man kann die Elemente durch einen Klick auf das kleine Dreieck-Icon öffnen/schließen.</p><p>Der XML-Editor stellt sicher, dass keine ungültige Konfiguration erzeugt werden kann. Falls einige Änderungen nicht möglich sind, dann ist das diesem Umstand geschuldet.</p><h4>Attribute bearbeiten</h4><p>Die Attribute eines Elements können bearbeitet werden, indem man einen Doppelklick auf dem Element ausführt. Alternativ stehen im Kontextmenü (öffnen mit rechter Maustaste) und in der Symbolleiste direkt über dem Baum "Bearbeiten"-Buttons zur Verfügung .</p><h4>Element bearbeiten</h4><p>Die Elemente im Baum unterstützen eine Umsortierung via Drag&Drop. Sie können ebenfalls ausgeschnitten, kopiert und eingefügt werden. Neue Elemente können hinzugefügt werden, indem man auf den '+'-Button unter dem Baum klickt (Maustaste gedrückt halten) und diesen dann an die Stelle zieht, an der man das neuen Element einfügen möchte. Alternativ steht über das Kontextmenü ein 'Kind-Element einfügen'-Button zur Verfügung.</p><p>Selektierte Elemente können über die Symbolleiste und das Kontextmenü gelöscht werden.</p><h4>Expertenansicht</h4><p>Normalerweise sind einige Attribute nicht sichtbar im Editier-Dialog. Über den 'Expertansicht'-Button in der Symbolleiste kann man diese freischalten.</p><h4>Vorschau</h4><p>Auf der rechten Seite wird eine Vorschau der Konfiguration gezeigt. Diese aktualisiert sich nicht automatisch. Über den Button in der Symbolleiste ganz rechts, kann man die Vorschau aktualisieren.</p>

source: Preview shows the current state of the edited configuration.
de: Die Vorschau zeigt den aktuellen Stand der Konfiguration an.

source: Preview is out of sync. Highlighting of the currently selected tree element is deactivated until you refresh the preview. Click here to refresh.
de: Die Vorschau zeigt nicht mehr den aktuellen Zustand der Konfiguration an. Das Hervorheben des gerade selektierten Elements ist deaktiviert bis die Vorschau aktualisiert wurde. Klicken Sie hier, um die Vorschau zu aktualisieren.

source: Please create a new Element either by dragging this button to the place where the new element should be inserted or by selecting an element and pressing this button to insert a new child to this element.
de: Bitte erzeugen Sie ein neues Element indem Sie diesen Button auf die Stelle an der das neue Element platziert werden soll ziehen oder indem Sie ein Element auswählen und über einen Klick auf diesen Button ein neues Element als Kind-Element der Selektion anlegen.

source: Preview is out of sync. Click here to refresh.
de: Die Vorschau zeigt nicht mehr den aktuellen Zustand der Konfiguration an. Klicken Sie hier, um die Vorschau zu aktualisieren.

source: Line %1
de: Zeile %1

source: Invalid text content: '%1'
de: Ungültiger Textinhalt: '%1'

source: Invalid value
de: Ungültiger Wert

source: Attribute '%1' not allowed
de: Attribut '%1' ist nicht erlaubt

source: Attribute '%1' is required but missing
de: Attribut '%1' fehlt

source: Text content is missing
de: Fehlender Textinhalt

source: Possible values could no be retrieved, please check browser console for error details
de: Die möglichen Werte konnten nicht geladen werden. Details zum Fehler können in der Browser-Konsole nachgelesen werden

source: "%1" has been moved after "%2"
de: "%1" wurde hinter "%2" verschoben

source: "%1" has been copied after "%2"
de: "%1" wurde hinter "%2" kopiert

source: "%1" has been moved before "%2"
de: "%1" wurde vor "%2" verschoben

source: "%1" has been moved into "%2" as first child
de: "%1" wurde als erstes Element in "%2" verschoben

source: "%1" has been copied into "%2" as first child
de: "%1" wurde als erstes Element in "%2" kopiert

source: "%1" has been moved into "%2"
de: "%1" wurde in "%2" verschoben
