Repository: CometVisu/CometVisu
Catalog: source/translation/*.po
Languages: de

source: "%1" has been copied into "%2"
de: "%1" wurde in "%2" kopiert

source: "%1" has been copied before "%2"
de: "%1" wurde vor "%2" kopiert

source: Create new %1 element
de: Erzeuge neues %1 Element

source: Please edit the attributes of the new %1 element, that will be added to the chosen position.
de: Bitte bearbeiten Sie die Attribute des neuen %1 Elements, welches an der gewünschten Stelle erzeugt wird.

source: Edit element attributes
de: Element Attribute bearbeiten

source: Please edit the content of the new %1 element, that will be added to the chosen position.
de: Bitte bearbeiten Sie den Inhalt des neuen %1 Elements, welches an der gewünschten Stelle erzeugt wird.

source: Edit element and content
de: Element und Inhalt bearbeiten

source: Edit element content
de: Elementinhalt bearbeiten

source: Edit text content
de: Textinhalt bearbeiten

source: About
de: Über

source: Build date
de: Erzeugt am

source: Build revision
de: Revision

source: Text content is invalid
de: Textinhalt ist ungültig

source: Child element '%1' not allowed.
de: Kind-Element '%1' ist nicht erlaubt.

source: "%1" is not writable. Upgrading not possible.
de: "%1" ist nicht speicherbar. Upgrade kann nicht durchgeführt werden.

source: Diagram communication error
de: Diagram Kommunikations-Fehler

source: URL: %1<br/><br/>Response:</br>%2
de: URL: %1<br/><br/>Antwort:</br>%2

source: TR-064 communication error
de: TR-064 Kommunikations-Fehler

source: TR-064 communication response error
de: TR-064 Kommunikation-Antwort-Fehler

source: Reading URL "%1" failed with status "%2": "%2"
de: Lesen der URL "%1" mit Status "%2" fehlgeschlagen: "%2"

source: refreshCalllist() error: "%1"
de: refreshCalllist() Fehler: "%1"

source: Reading URL "%1" failed with content: "%2"
de: Lesen der URL "%1" nicht möglich. Inhalt: "%2"

source: This file has unsaved changes that will be lost when you close it without saving.
de: Diese Datei enthält ungespeicherte Änderungen, die verloren gehen, wenn Sie sie ohne zu speichern schließen.

source: This file has not been saved on the backend yet. It will be lost when you close it without saving.
de: Diese Datei wurde noch nicht gespeichert. Sie wird verloren gehen, wenn Sie sie ohne zu speichern schließen.

source: You have files opened with unsaved changes, you should save them now.
de: Sie haben Dateien mit ungespeicherten Änderungen geöffnet, Sie sollten diese jetzt speichern.

source: Quit without saving
de: Beenden ohne zu speichern

source: Save & close
de: Speichern & schließen

source: Discard & close
de: Verwerfen & schließen

source: Save & quit
de: Speichern & beenden

source: Manager is not available
de: Der Manager steht nicht zu Verfügung

source: Your system does not provide the required PHP version for the manager. Installed: %1, required: %2
de: Die auf Ihrem System installierte PHP Version wird vom Manager nicht unterstützt. Installiert: %1, erforderlich: %2

source: Sub-selector "%1" does not fit to value %2
de: Sub-Selektor "%1" passt nicht zum Wert %2

source: Sub-selector "%1" has bad first part "%2"
de: Sub-Selektor "%1" hat fehlerhaften ersten Teil "%2"

source: Sub-selector error: "%1"
de: Sub-Selektor Fehler: "%1"

source: decode: JSON.parse error: %1; selector: "%2"; value: %3
de: Dekodieren: JSON.parse Fehler: %1; Selektor: "%2"; Wert: %3

source: Transform decode error
de: Transform Dekodier-Fehler

source: Transform encode error
de: Transform Enkodier-Fehler

source: Encode error: %1; selector: "%2"; value: %3
de: Enkodier-Fehler: %1; Selektor: "%2"; Wert: %3

source: Updating ColorChooser with invalid data<br/>Address: "%1"<br/>transform: "%2"<br/>selector: "%3"<br/>variant: "%4"<br/>data: "%5"
de: Versuchtes ColorChooser Update mit ungültigen Daten.<br/>address: "%1"<br/>transform: "%2"<br/>selector: "%3"<br/>variant: "%4"<br/>data: "%5"

source: You can open the manager to create or upload a config file.
de: Sie können den Manager öffnen, um eine neue Konfigurations-Datei zu erstellen oder eine bestehende hochzuladen.

source: Open manager
de: Manager öffnen

source: File Error!
de: Dateifehler!

source: Invalid XML file!
de: Ungültige XML Datei!

source: 404: File not found, %1.
de: 404: Datei nicht gefunden, %1.

source: Restart connection
de: Verbindung neu starten

source: This is no pure-structure config, root element pages not found
de: Diese Konfigurationsdatei enthält keine Pure-Struktur, das Wurzelelement pages wurde nicht gefunden

source: Config error
de: Konfigurationsfehler

source: Communication error
de: Kommunikationsfehler

source: There already exists a backend named: "%1"
de: Es existiert bereits ein Backend mit dem Namen: "%1"

source: Convert to tile structure
de: In Tile-Struktur konvertieren

source: Icon name has been copied to clipboard
de: Der Icon-Name wurde in die Zwischenablage kopiert

source: Connection to backend "%1" is lost.
de: Verbindung zum Backend "%1" verloren.

source: File "%1" has been renamed to "%2"
de: Datei "%1" wurde umbenannt in "%2"

source: Folder "%1" has been renamed to "%2"
de: Ordner "%1" wurde umbenannt in "%2"

source: Your server does not support PHP
de: Ihr Server unterstützt kein PHP

source: Disabling preview because the preview file could not be created.
de: Vorschau wurde deaktiviert, weil die Vorschaudatei nicht erzeugt werden konnte.

source: Hidden configuration error
de: Fehler in der versteckten Konfiguration

source: Hidden configuration has a syntax error and could not be loaded, you can try to fix the problem in the text editor. Do you want to open the file in the text editor?
de: Die versteckte Konfiguration enthält einen Syntax-Fehler und konnte nicht geladen werden, Sie können versuchen das Problem im Texteditor zu beheben. Möchten Sie die Datei im Texteditor öffnen?

source: previous
de: zurück

source: next
de: vor

source: today
de: heute

source: yesterday
de: gestern

source: CW %1
de: KW %1

source: Last update: %1
de: Letzte Aktualisierung: %1
